n3tk0/ESP32_Logger/node/src/ConfigPortal.cpp
#include "ConfigPortal.h"

#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <DNSServer.h>
#include <ArduinoJson.h>
#include <new>

#include "NodeStore.h"
#include "NodeLog.h"
#include "node_common/NodeSensors.h"
#include "src/nodecfg/NodeConfigJson.h"
#include "NodeCfgTables.h"
#include "src/nodecfg/NodePortalPage.h"
#include "FwFlash.h"

using nodecfg::NodeConfig;

// The sync web server is the right shape here: the page is a handful of
// requests from one phone, the AP portal runs only while nothing else is
// happening, and blocking inside a handler costs nothing when there is no
// sensor loop to stall.
static ESP8266WebServer        s_http(80);
static DNSServer               s_dns;
static NodeConfig*             s_target  = nullptr;
static const PortalLinkStatus* s_link    = nullptr;
static bool                    s_saved   = false;
static uint32_t                s_savedAt = 0;

/// §6: "{"ok":true} then restart after 500 ms". Long enough for the reply to
/// leave; the page then polls /api/status for the new uptime.
static const uint32_t kRestartDelayMs = 500;

/// True while the page is being served on the STA interface — the home LAN —
/// rather than on the node's own access point.
///
/// THE DIFFERENCE IS WHO CAN REACH IT. To open the AP portal you have to be
/// associated with the node's access point, standing next to it, during a
/// window it opens only after repeated WiFi failures. The background server
/// is on the LAN, for the node's whole uptime, reachable by anything on the
/// network — so every route there sits behind basic auth.
static bool s_background = false;

/// Handlers are registered once for the life of the process.
///
/// ESP8266WebServer::on() appends to a list and never deduplicates, and
/// portalStartBackground() is called on every transition back to connected —
/// so a node whose router reboots nightly grew dead handler entries a night,
/// walked on every request, until it ran out of heap.
static bool s_routesBound = false;

void portalSetLinkStatus(const PortalLinkStatus* s) { s_link = s; }

/// Basic auth on the background server, using the credentials the node
/// already holds for the collector.
///
/// Reusing them is not elegant, but the alternative was worse in both
/// directions: a new setting nobody would fill in, or a page on the LAN that
/// anyone could POST to, repointing the node at their own collector and
/// restarting it. The AP portal is not gated, because reaching it already
/// requires the AP's own password.
static bool authOk() {
    if (!s_background) return true;
    const NodeConfig& c = *s_target;
    if (c.net.basic_user[0] && c.net.basic_pass[0] &&
        s_http.authenticate(c.net.basic_user, c.net.basic_pass))
        return true;
    s_http.requestAuthentication();
    return false;
}

bool portalButtonHeld() {
    pinMode(PORTAL_TRIGGER_PIN, INPUT_PULLUP);
    // One read can catch a floating pin mid-transition; require the button to
    // still be down after a debounce interval.
    if (digitalRead(PORTAL_TRIGGER_PIN) != LOW) return false;
    delay(50);
    return digitalRead(PORTAL_TRIGGER_PIN) == LOW;
}

// ---------------------------------------------------------------------------
// Replies
// ---------------------------------------------------------------------------

/// Serialise into a String and let the document go BEFORE sending: on a part
/// with ~40 KB of heap the JsonDocument and the socket buffers should not
/// both be alive at the peak. The caller builds the document in a scope that
/// ends before this returns.
static void sendJson(int code, const String& body) {
    s_http.sendHeader("Cache-Control", "no-store");
    s_http.send(code, "application/json", body);
}

static void sendError(int code, const char* field, const char* reason) {
    String out;
    {
        JsonDocument doc;
        doc["ok"]     = false;
        doc["field"]  = field;
        doc["reason"] = reason;
        serializeJson(doc, out);
    }
    sendJson(code, out);
}

// ---------------------------------------------------------------------------
// GET / — the page
// ---------------------------------------------------------------------------

/// The gzip bytes exactly as tools/build_node_portal.py wrote them, streamed
/// out of flash by send_P in small chunks — never copied into RAM whole. The
/// browser inflates it; every browser since 2000 does.
static void handlePage() {
    if (!authOk()) return;
    s_http.sendHeader("Content-Encoding", "gzip");
    s_http.sendHeader("Cache-Control", "no-store");
    s_http.send_P(200, PSTR("text/html; charset=utf-8"),
                  (PGM_P)NODE_PORTAL_GZ, sizeof(NODE_PORTAL_GZ));
}

// ---------------------------------------------------------------------------
// GET /api/config
// ---------------------------------------------------------------------------

static void handleConfigGet() {
    if (!authOk()) return;
    String out;
    {
        JsonDocument doc;
        // No NCJ_SECRETS: the passphrase, token and basic-auth password go
        // out as "" plus "<field>_set", here and everywhere a GET answers.
        nodecfg::encodeConfig(*s_target, doc["config"].to<JsonObject>(), 0);
        nodeEncodeCaps(doc["caps"].to<JsonObject>());
        if (doc.overflowed()) {
            sendError(500, "", "out of memory");
            return;
        }
        out.reserve(measureJson(doc) + 1);
        serializeJson(doc, out);
    }
    sendJson(200, out);
}

// ---------------------------------------------------------------------------
// POST /api/config
// ---------------------------------------------------------------------------

/// What a POST decodes into: a whole candidate config and the validator's
/// answer — about 1.5 KB together, so on the heap for the length of the
/// request rather than on the 4 KB loop stack or in static RAM for ever.
struct PostWork {
    NodeConfig            cfg;
    nodecfg::Validation   v;
    nodecfg::Issue        issue;
};

static void handleConfigPost() {
    // Checked HERE too, not only on the page. A POST does not have to come
    // from a page this device served, and this is the handler that rewrites
    // the node's collector address and then restarts it.
    if (!authOk()) return;

