n3tk0/ESP32_Logger/node/src/ConfigPortal.cpp
    PostWork* w = new (std::nothrow) PostWork();
    if (!w) {
        sendError(500, "", "out of memory");
        return;
    }
    // Decode onto a COPY. Writing straight into the running config would
    // leave it half-applied on the refusal paths below, and the node would run
    // on a config that is neither the old one nor the new one until a reboot.
    w->cfg = *s_target;
    bool decoded;
    {
        JsonDocument doc;
        const DeserializationError err = deserializeJson(doc, s_http.arg("plain"));
        if (err || !doc.is<JsonObject>()) {
            delete w;
            sendError(400, "", "not a JSON object");
            return;
        }
        // No NCJ_DEC_REV: a page echoing a stale rev must not overwrite the
        // real one, and transport/hw/fw are the firmware's to say.
        decoded = nodecfg::decodeConfig(doc, w->cfg, 0, &w->issue);
    }
    if (!decoded) {
        LOGF("[portal] refused %s: %s\n", w->issue.field, w->issue.reason);
        sendError(400, w->issue.field, w->issue.reason);
        delete w;
        return;
    }

    nodeValidate(w->cfg, w->v);
    if (!w->v.ok) {
        LOGF("[portal] refused %s: %s\n", w->v.error.field, w->v.error.reason);
        String out;
        {
            JsonDocument doc;
            nodecfg::encodeValidation(w->v, doc.to<JsonObject>());
            serializeJson(doc, out);
        }
        delete w;
        sendJson(400, out);
        return;
    }

    // §0.4: a change made here wins. `local` makes the node report the whole
    // config on its next POST; the collector adopts it and confirms the rev.
    w->cfg.local = true;
    if (!storeSave(w->cfg, true)) {
        delete w;
        sendError(500, "", "could not write to the filesystem");
        return;
    }
    // A network change the collector sent may be on trial (§4.7). Whoever is
    // at this page has taken over: rolling back underneath them would throw
    // away what they just typed.
    {
        SyncState ss;
        syncLoad(ss);
        if (ss.trialRev) {
            ss.trialRev = 0;
            syncSave(ss);
        }
    }

    *s_target = w->cfg;
    String out;
    {
        JsonDocument doc;
        nodecfg::encodeValidation(w->v, doc.to<JsonObject>());   // ok + any warnings
        serializeJson(doc, out);
    }
    delete w;
    sendJson(200, out);
    s_saved   = true;
    s_savedAt = millis();
    LOGLN("[portal] saved; restarting");
}

// ---------------------------------------------------------------------------
// GET /api/scan — the network picker
// ---------------------------------------------------------------------------
//
// One endpoint that starts a scan and reports it, polled by the page, for the
// reason the collector splits its scan the same way: an ESP8266 scan takes
// two seconds or more, and doing it inside the request would hold the only
// web-server thread the portal has — on the AP, that is the phone's own
// connection timing out. scanNetworks(true) returns immediately.

/// True while the scan has the radio widened from AP to AP+STA, so the mode
/// can be put back. The ESP8266 has ONE radio: the softAP and the station
/// share a channel, and a station that associates drags the AP onto its
/// channel — disassociating the phone that is standing in the portal. Leaving
/// AP_STA on for the rest of the session leaves that trap armed.
static bool     s_widenedForScan = false;
static bool     s_scanPending    = false;   ///< results belong to a scan we started
static uint32_t s_scanStartedMs  = 0;

/// How long the radio may stay widened before the portal narrows it itself.
/// An ESP8266 scan is two to four seconds; the page polls every second or
/// so, so nothing legitimate is still waiting at twenty. Well clear of a slow
/// scan, well inside a session.
static const uint32_t kScanCeilingMs = 20000;

/// Put the radio back the way the portal found it, once the scan is over.
static void narrowAfterScan() {
    if (!s_widenedForScan) return;
    s_widenedForScan = false;
    WiFi.mode(WIFI_AP);
}

/// THE BROWSER IS THE HALF OF THIS THAT CAN WALK AWAY.
///
/// narrowAfterScan() runs on the /api/scan poll, which is the page's job.
/// Close the tab, let its own retry counter give up, drop the link, or lock
/// the phone — the poll stops, the scan finishes into a buffer nobody reads,
/// and the radio stays in AP_STA for the rest of the portal session with
/// exactly the trap armed that narrowAfterScan() exists to disarm.
///
/// So the portal narrows on a ceiling of its own rather than on being asked.
/// Time and not completion, deliberately: changing mode is entitled to drop
/// the scan results, and narrowing the moment the scan finished would race
/// the poll that is about to collect them.
static void scanWatchdog() {
    if (!s_widenedForScan) return;
    if ((millis() - s_scanStartedMs) > kScanCeilingMs) {
        LOGLN("[portal] scan abandoned; putting the radio back to AP");
        s_scanPending = false;
        narrowAfterScan();
    }
}

static void startScan() {
    // Widen AP → AP_STA so the access point the phone is sitting on stays up
    // while the radio scans. On the LAN the node is already in STA and can
    // scan as it is.
    if (WiFi.getMode() == WIFI_AP) {
        WiFi.mode(WIFI_AP_STA);
        s_widenedForScan = true;
        // Scanning does not need an association, and an association is the
        // thing that would move the AP's channel. portalRun() can be reached
        // from setup() before anything calls WiFi.disconnect(), so the SDK
        // may still hold credentials from flash and auto-connect on its own
        // the moment the station interface comes up.
        WiFi.disconnect(false);
    }
    WiFi.scanDelete();
    WiFi.scanNetworks(true);
    s_scanPending   = true;
    s_scanStartedMs = millis();
}

static void handleScan() {
    if (!authOk()) return;

    const int n = WiFi.scanComplete();
    if (n == WIFI_SCAN_RUNNING) {
        sendJson(200, F("{\"state\":\"running\"}"));
        return;
    }
    if (n < 0 || !s_scanPending) {
        // Nothing started yet, a failed scan, or results left over from a
        // scan nobody here asked for: start a fresh one.
        startScan();
        sendJson(200, F("{\"state\":\"running\"}"));
        return;
    }

    String out;
    {
        JsonDocument doc;
        doc["state"] = "done";
        JsonArray nets = doc["nets"].to<JsonArray>();
        // Twenty is more than any hallway shows on a phone, and the JSON is
        // built in RAM on a part that has little of it.
        for (int i = 0; i < n && i < 20; i++) {
            JsonObject o = nets.add<JsonObject>();
            o["ssid"] = WiFi.SSID(i);
            o["rssi"] = WiFi.RSSI(i);
            o["ch"]   = WiFi.channel(i);
            // The core's own number: ENC_TYPE_NONE (7) is an open network.
            // The page reads it by caps.hw (§6).
            o["enc"]  = WiFi.encryptionType(i);
        }
        serializeJson(doc, out);
    }
    WiFi.scanDelete();
    s_scanPending = false;
    narrowAfterScan();
    sendJson(200, out);
}

// ---------------------------------------------------------------------------
// GET /api/status
// ---------------------------------------------------------------------------

static void handleStatus() {
    if (!authOk()) return;
    const NodeConfig& c = *s_target;
    String out;
    {
        JsonDocument doc;
        doc["uptime_s"] = millis() / 1000UL;
        if (WiFi.status() == WL_CONNECTED) doc["rssi"] = WiFi.RSSI();
        else                               doc["rssi"] = nullptr;
        if (s_link && s_link->everOk)
            doc["last_ok_s"] = (millis() - s_link->lastOkMs) / 1000UL;
        else
            doc["last_ok_s"] = nullptr;
        doc["ip"]    = s_background ? WiFi.localIP().toString() : WiFi.softAPIP().toString();
        doc["mac"]   = WiFi.macAddress();
        doc["rev"]   = c.rev;
        doc["local"] = c.local;
        const char* col = "unknown";
        if (s_link && s_link->attempted) col = s_link->lastOk ? "reachable" : "unreachable";
        doc["collector"] = col;
        // Beyond §6, for whoever reads it by hand: what the sensors said at
        // their last bring-up, and which firmware this is.
        doc["sensors"] = nodeSensorsDescribe();
        doc["fw"]      = (const char*)c.fw;
        serializeJson(doc, out);
    }
    sendJson(200, out);
}

// ---------------------------------------------------------------------------
// POST /update — a firmware image from the page (docs/NODE_OTA.md §5)
// ---------------------------------------------------------------------------
//
// multipart/form-data, one file (field "fw"), streamed chunk by chunk
// (HTTP_UPLOAD_BUFLEN, 2 KB) through FwFlash into the update slot — never
// held in RAM, which on this part could not hold a tenth of it. FwFlash
// checks the header on the first chunk and the marker once the last one is
// in; a refused image is ended with the MD5 trick and never committed, so a
// wrong file costs the flash writes and nothing else.
//
// The server calls the upload half once per chunk and the done half once the
// body is in; the answer (§5's table) goes out from the done half:
//
//   200 {"ok":true}                                  staged; restart in ~1 s
//   400 {"ok":false,"error":"not_node_image"}        header, marker or kind
//   400 {"ok":false,"error":"too_big"}               larger than the slot
//   500 {"ok":false,"error":"write_failed","detail"} the flash said no
//
// A local update arms nothing and asks nobody: the person doing it is
// standing at the page. The readings the node holds in RAM for the collector
// are lost with the restart, as they are when the page saves a config.

/// §5: "the node restarts about a second later" — long enough for the 200 to
/// leave; the page then waits for the node to come back.
static const uint32_t kFwRestartDelayMs = 1000;

static FwFlash* s_fw        = nullptr;   ///< on the heap only while a request is in
static bool     s_fwSeen    = false;     ///< this request carried a file
static bool     s_fwAuthed  = false;
static bool     s_fwOk      = false;     ///< verified and staged
static bool     s_fwStaged  = false;     ///< answered 200; restart pending
static uint32_t s_fwStagedAt = 0;

