n3tk0/ESP32_Logger/node/src/ConfigPortal.cpp
/// The auth gate of the upload half, which runs once per chunk. Decided at
/// UPLOAD_FILE_START — the headers are in by then — and remembered for the
/// rest of the body. requestAuthentication() is not called here: that would
/// answer in the middle of the request body. The 401 goes out from
/// handleUpdateDone(), and nothing is written in the meantime.
static bool authOkUpload() {
    if (s_http.upload().status == UPLOAD_FILE_START) {
        const NodeConfig& c = *s_target;
        s_fwAuthed = !s_background ||
                     (c.net.basic_user[0] && c.net.basic_pass[0] &&
                      s_http.authenticate(c.net.basic_user, c.net.basic_pass));
    }
    return s_fwAuthed;
}

static void handleUpdateUpload() {
    if (!authOkUpload()) return;
    HTTPUpload& up = s_http.upload();
    switch (up.status) {
        case UPLOAD_FILE_START:
            // One image per request: a second file part is not a second
            // update over the first.
            if (s_fwSeen) return;
            s_fwSeen = true;
            s_fwOk   = false;
            LOGF("[portal] firmware upload \"%s\" (heap %u)\n", up.filename.c_str(),
                 (unsigned)ESP.getFreeHeap());
            delete s_fw;
            s_fw = new (std::nothrow) FwFlash();
            if (s_fw) s_fw->begin(0, nullptr);   // a failure is kept in error()
            break;
        case UPLOAD_FILE_WRITE:
            if (s_fw && s_fw->active()) s_fw->write(up.buf, up.currentSize);
            break;
        case UPLOAD_FILE_END:
            if (s_fw && s_fw->active()) s_fwOk = s_fw->finish();
            break;
        case UPLOAD_FILE_ABORTED:
            // The browser went away mid-body.
            if (s_fw) s_fw->abort();
            break;
    }
}

static void handleUpdateDone() {
    if (!authOk()) {
        if (s_fw) s_fw->abort();
        delete s_fw;
        s_fw = nullptr;
        s_fwSeen = s_fwOk = false;
        return;
    }
    int code = 200;
    const char* err = nullptr;
    String detail;
    if (s_fwOk) {
        s_fwStaged   = true;
        s_fwStagedAt = millis();
    } else if (!s_fwSeen) {
        err = "not_node_image";   // no file in the request at all
    } else if (!s_fw) {
        err = "write_failed";
        detail = F("out of memory");
    } else {
        s_fw->abort();   // a body that stopped before UPLOAD_FILE_END
        err = s_fw->error() ? s_fw->error() : "not_node_image";
        detail = s_fw->detail();
    }
    delete s_fw;
    s_fw = nullptr;
    s_fwSeen = s_fwOk = false;

    String out;
    {
        JsonDocument doc;
        doc["ok"] = (err == nullptr);
        if (err) {
            // Only the three words §5 promises reach the page.
            if (strcmp(err, "not_node_image") != 0 && strcmp(err, "too_big") != 0) {
                if (!detail.length()) detail = err;
                err = "write_failed";
            }
            code = strcmp(err, "write_failed") == 0 ? 500 : 400;
            doc["error"] = err;
            if (code == 500) doc["detail"] = detail;
            LOGF("[portal] firmware refused: %s %s\n", err, detail.c_str());
        } else {
            LOGLN("[portal] firmware staged; restarting in a second");
        }
        serializeJson(doc, out);
    }
    sendJson(code, out);
}

/// Restart into the staged image once the 200 has had its second.
static void fwRestartIfDue() {
    if (s_fwStaged && millis() - s_fwStagedAt >= kFwRestartDelayMs) {
        LOGLN("[portal] restarting into the new firmware");
        delay(50);
        ESP.restart();
    }
}

// ---------------------------------------------------------------------------

/// Both portals answer the same routes. Registered once — see s_routesBound
/// above for what re-registering used to cost.
static void bindRoutes() {
    if (s_routesBound) return;
    s_http.on("/", HTTP_GET, handlePage);
    s_http.on("/api/config", HTTP_GET, handleConfigGet);
    s_http.on("/api/config", HTTP_POST, handleConfigPost);
    s_http.on("/api/scan", HTTP_GET, handleScan);
    s_http.on("/api/status", HTTP_GET, handleStatus);
    s_http.on("/update", HTTP_POST, handleUpdateDone, handleUpdateUpload);
    // Every other path gets the page: that is what makes a phone's captive-
    // portal probe (generate_204, hotspot-detect.html, …) open it.
    s_http.onNotFound(handlePage);
    s_routesBound = true;
}

bool portalRun(NodeConfig& c, uint32_t timeoutMs) {
    s_target     = &c;
    s_saved      = false;
    s_background = false;   // the AP portal: no auth gate

    char ap[32];
    // The chip-id suffix keeps two nodes in one house apart on the air.
    snprintf(ap, sizeof(ap), "esp-node-%04X", (uint16_t)(ESP.getChipId() & 0xFFFF));

    WiFi.mode(WIFI_AP);
    WiFi.softAP(ap, PORTAL_AP_PASS);
    delay(100);

    const IPAddress ip = WiFi.softAPIP();
    LOGF("[portal] \"%s\" up at http://%s  (pass: %s)\n",
                  ap, ip.toString().c_str(), PORTAL_AP_PASS);
    if (timeoutMs) LOGF("[portal] closing in %lu s\n",
                                 (unsigned long)(timeoutMs / 1000));

    // Answer every DNS query with our own address so phones show the
    // "sign in to network" prompt instead of leaving the user to discover
    // 192.168.4.1 on their own.
    s_dns.setErrorReplyCode(DNSReplyCode::NoError);
    s_dns.start(53, "*", ip);

    bindRoutes();
    s_http.begin();

    uint32_t start     = millis();
    bool     hadClient = false;
    while (true) {
        s_dns.processNextRequest();
        s_http.handleClient();
        scanWatchdog();
        fwRestartIfDue();

        if (s_saved) {
            if (millis() - s_savedAt >= kRestartDelayMs) break;
            delay(5);
            continue;
        }

        // THE CLOCK STOPS WHILE SOMEBODY IS CONNECTED, and restarts when they
        // leave. Both halves matter, and an earlier rewrite of this file kept
        // the comment while dropping the assignments — which is worse than
        // never having had them, because the behaviour it describes is the
        // reason the timeout is survivable.
        //
        // The timeout exists so a node does not sit in AP mode forever after a
        // 3 am router reboot nobody witnessed. A station associated to the
        // softAP is the opposite of that: direct evidence a human is standing
        // there, mid-configuration. Without the reset the window closes under
        // them — joining the AP, waiting out the phone's "no internet, stay
        // connected?" prompt and working through the steps is comfortably
        // more than five minutes from boot, and a phone that roams off the
        // no-internet AP for one loop iteration would take the portal with it.
        const bool client = WiFi.softAPgetStationNum() > 0;
        if (client) {
            start = millis();          // hold the window open
            hadClient = true;
        } else if (hadClient) {
            // They left without saving. A fresh window rather than a stale
            // count, so a reconnect gets the whole five minutes again.
            hadClient = false;
            start = millis();
        }

        if (timeoutMs && !client && (millis() - start) > timeoutMs) {
            LOGLN("[portal] timed out, retrying the saved network");
            break;
        }
        delay(5);   // feeds the softAP task; yield() alone starves it here
    }

    s_http.stop();
    s_dns.stop();
    s_scanPending = false;
    s_widenedForScan = false;
    WiFi.softAPdisconnect(true);
    WiFi.mode(WIFI_OFF);

    return s_saved;
}

bool portalStartBackground(NodeConfig& c) {
    // FAILS CLOSED. Without credentials there is nothing between this page and
    // everything on the network, and the page rewrites the node's collector
    // address and restarts it. Refusing is a feature the user has to turn on by
    // setting a password, which is the right way round; serving it anyway would
    // be a remote-configuration interface nobody asked to expose.
    if (c.net.basic_user[0] == '\0' || c.net.basic_pass[0] == '\0') {
        Serial.println(F("[portal] background server NOT started: set a basic-auth "
                         "user and password in the setup page to enable "
                         "configuration over the LAN"));
        return false;
    }

    s_target     = &c;
    s_saved      = false;
    s_background = true;

    bindRoutes();
    s_http.begin();
    LOGF("[portal] background configuration server on http://%s/ "
                  "(password protected)\n", WiFi.localIP().toString().c_str());
    return true;
}

void portalHandleClient() {
    s_http.handleClient();
    if (s_fwStaged) {
        // As below: the reply leaves, then the restart.
        while (millis() - s_fwStagedAt < kFwRestartDelayMs) {
            s_http.handleClient();
            delay(5);
        }
        fwRestartIfDue();
    }
    if (s_saved) {
        // Let the reply leave before the restart takes the socket with it.
        while (millis() - s_savedAt < kRestartDelayMs) {
            s_http.handleClient();
            delay(5);
        }
        LOGLN("[portal] settings saved via background server, restarting");
        ESP.restart();
    }
}
